app/controllers/songs_controller.rb

  def index

    if params[:artist_id]
       if !Artist.find_by_id params[:artist_id]
          flash[:alert] = "Artist not found."
          redirect_to artists_path
        else
          @songs = Artist.find(params[:artist_id]).songs
        end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs"

  def show
      if !Song.find_by_id params[:id]
          flash[:alert] = "Song not found."
          redirect_to artist_path(Artist.find(params[:artist_id])
      else
        @song = Song.find(params[:id])
      end

  end

  def new
    @song = Song.new
  end

  def create
    @song = Song.new(song_params)

    if @song.save
      redirect_to @song
    else
      render :new
    end
  end

---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]